Revit API Introduction Labs
Lab1_1_HelloWorld Class
 Say hello.
 Prerequisites for the Revit API Introduction labs are the following installed components:
Revit
The Revit SDK
Visual Studio
Revit API Introduction Labs
 The Revit API Introduction Labs are provided in two versions, as exercises for completing by filling in the missing portions yourself using the information from the SDK documentation and the lab instructions, and a solved version which you can use to peek into if you run into any difficulties.
 In this lab, we explore the development environment, and how to create a skeleton Revit add-in from scratch. We explore the transaction mode and regeneration option attributes, and the add-in manifest information defining the link between Revit and the external command. Also, how the external command can be hooked up with a custom user interface by an external application.
 Before working on this lab, ensure that you have located and had a first look at the following important Revit SDK documentation, which contains all the information required:
Getting Started with the Revit API.doc
Revit Platform API Changes and Additions.doc
Revit 2011 API Developer Guide.pdf
RevitAPI.chm
 To complete this lab, look at the developer guide in the Revit SDK, in the file Revit 2011 API Developer Guide.pdf, and work through the walkthroughs described in Chapter 2, especially 2.2 Hello World and 2.3 Ribbon Panel.
They show how to:
Set up a new add-in project.
Add the Revit API references.
Edit the add-in source code.
Create an add-in manifest.
Load and debug the add-in.
Create a custom ribbon panel.
 You can work through the walkthroughs from scatch as described in the developer guisde, or complete the missing code in the skeleton file provided by the Revit API introduction lab exercises.
 The client id for the add-in manifest can be generated using the Visual Studio GuidGen tool or the Guidizer provided by ADN.
 This lab can also be used to explore the TaskDialog class provided for Revit-style message boxes. For further examples of using the Revit API TaskDialog features, please also refer to the HelloRevit SDK sample.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public class Lab1_1_HelloWorld : IExternalCommand
Visual Basic (Declaration)
Public Class Lab1_1_HelloWorld _
	Implements IExternalCommand
Visual C++
public ref class Lab1_1_HelloWorld : IExternalCommand
Remarks
Say hello some more!
Some remarks on Lab 1-1.
Inheritance Hierarchy
System.Object
 Labs.Lab1_1_HelloWorld
See Also
Lab1_1_HelloWorld Members
Labs Namespace